{
  "backend/main.mo": "Main backend actor defining 8 user roles (superadmin, admin, finance, concierge, strategicPartner, asistenmu, client, partner), user management with pending/active status, ID generation functions, and admin functions for approving/rejecting users with access control integration.",
  "feature_evidence.json": "Feature evidence report documenting implementation of pending user management in InternalDashboard.tsx including state management, fetch functions, approval/rejection handlers, and UI components with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for landing pages, dashboards, registration flows, authentication, and custom hooks for backend integration with React Query.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes with emerald/teal professional color palette and design tokens.",
  "frontend/index.html": "HTML entry point for the Work Management Hub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup, authentication flow using Internet Identity, superadmin claim logic, user status checks, and role-based routing to appropriate dashboards with loading states.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying pending user registrations with approve/reject actions, legacy approval system, statistics cards, and toast notifications using React Query hooks for data fetching and mutations.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Displays a banner showing the user's approval status (approved, pending, or loading) with appropriate icons and styling using Alert components.",
  "frontend/src/components/ApprovedUserView.tsx": "Main routing component that displays AdminDashboard for admin users, PendingApprovalView for unapproved users, or a placeholder dashboard for approved non-admin users with profile link.",
  "frontend/src/components/ClientDashboard.tsx": "Dashboard view for client users showing profile information (ID, name, company, status) with header navigation and logout functionality.",
  "frontend/src/components/ClientRegisterPage.tsx": "Registration page for client users with Internet Identity login and form to submit name and company, redirects to dashboard if already registered and active.",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal staff (admin/superadmin) displaying pending user requests with approve/reject actions, user profile info, and role-based access control.",
  "frontend/src/components/InternalSystemPage.tsx": "Registration page for internal staff with Internet Identity login and form to select role (admin, finance, concierge, asistenmu, strategic partner) and submit name, redirects active internal users to dashboard.",
  "frontend/src/components/LandingPage.tsx": "Landing page component with hero section, service cards, and navigation. Includes expandable service descriptions, WhatsApp contact link, and smooth scrolling to services section.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component with Internet Identity integration. Supports two variants ('default' and 'hero') and handles authentication state with loading indicators.",
  "frontend/src/components/PartnerDashboard.tsx": "Partner dashboard view displaying partner profile information with header navigation and user dropdown menu. Shows partner ID, name, city, and status with logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration and portal access page with Internet Identity login. Handles partner registration form (name and city) and redirects active partners to dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "View displayed to users awaiting registration approval. Shows pending status with user details (name and requested role) and informational message about admin review.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty component file with no content.",
  "frontend/src/components/SuperadminClaimPage.tsx": "First-time setup page allowing the initial user to claim superadmin privileges. Displays success/error states and redirects to dashboard after successful claim.",
  "frontend/src/components/UserInfoPage.tsx": "Displays authenticated user profile information including name, role, status, and timestamps with formatted badges and icons. Shows loading state while fetching user data and includes a header with login button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing it with Internet Identity when available and invalidating dependent queries when the actor changes. Handles both authenticated and anonymous actor creation.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides hooks for managing user approvals including listing pending approvals, approving/rejecting users, and assigning user roles. Uses mutations to update approval status and invalidates related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login, logout, and identity management. Handles auth client creation, delegation validation, and provides authentication status tracking throughout the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching current user data including profile, role, approval status, and pending requests. All queries depend on the actor being available and handle loading states appropriately.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration as client, partner, or internal user with different required fields. Each mutation invalidates user-related queries upon successful registration.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Manages superadmin claiming functionality by checking if a superadmin exists and providing a mutation to claim superadmin role. Invalidates all user queries after successful claim.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom emerald/teal professional color theme for both light and dark modes using CSS custom properties. Includes base styles for smooth scrolling and typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with Inter and Cal Sans fonts, custom animations, and extended theme utilities for the application.",
  "project_state.json": "Project state tracking document for an internal dashboard with user registration approval workflow, listing 7 completed features for admin/superadmin pending user management and one in-progress feature request."
}