{
  "backend/main.mo": "Main Motoko actor defining types (User, Role, Status, Layanan, Task, etc.) and business logic for a work management system with user approval, service activation, task management, partner assignments, and financial operations including wallet and withdrawal features.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: fixing infinite loading spinner in UserManagementPage, and converting two dropdowns (Pilih Client and Pilih Asistenmu) in ActivateServiceModal to searchable comboboxes.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, hooks, pages, and configuration files with descriptions of their functionality and purpose.",
  "frontend/index.css": "Global CSS file with Tailwind directives and CSS custom properties defining a Premium Boutique OKLCH color system with warm off-white backgrounds, midnight slate primary colors, and champagne gold accents for light and dark modes.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Work Management Hub', root div, and script tag loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main application component handling authentication flow, superadmin claim logic, user profile loading, and role-based routing to appropriate dashboards (Partner, Client, Internal) with TanStack Router integration and loading states.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with two searchable comboboxes (client and asistenmu selection), service type dropdown, unit quantity input, price input with thousand-separator formatting, and form validation displaying effective hours and total GMV calculations.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays pending, approved, and rejected user registrations with approve/reject actions. Uses approval management hooks and displays statistics cards, user tables, and handles user approval workflow with toast notifications.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Banner component that displays the current user's approval status (approved or pending) with appropriate icons and styling. Shows a green checkmark for approved users and a clock icon for pending approval.",
  "frontend/src/components/ApprovedUserView.tsx": "Main routing component that checks user role and approval status to display appropriate views: AdminDashboard for admins, PendingApprovalView for unapproved users, or a placeholder dashboard for approved non-admin users. Includes header, approval banner, and footer.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard that displays tasks, active services, and profile management. Includes functionality to create new tasks, approve estimates, edit profile information, and logout, with WhatsApp integration for communication.",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and new client registration with form fields for name, company, phone, and email. Redirects active clients to dashboard and shows success/error states during registration.",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog component for editing user roles with a dropdown selector for all available roles (client, partner, admin, etc.). Handles role updates via actor calls and invalidates queries on success.",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal users (superadmin, admin, finance, etc.) displaying pending user requests with approve/reject actions, service activation modal access, and user management navigation. Includes role-based permission checks and user profile dropdown.",
  "frontend/src/components/InternalSystemPage.tsx": "Registration and login page for internal team members (admin, finance, concierge, asistenmu, strategic partner) with Internet Identity authentication. Redirects authenticated internal users with active status to the internal dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page featuring hero section, service cards with expandable details, and navigation to partner portal, client login/registration. Includes WhatsApp contact link and smooth scrolling to services section.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button component supporting Internet Identity login/logout with two variants (default and hero). Handles authentication state, loading states, and query cache clearing on logout.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard for partner users displaying profile information (ID, name, city, status) with header navigation and logout functionality. Shows partner-specific UI with yellow-themed avatar.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration and login page with Internet Identity authentication and form for name and city input. Redirects authenticated partners with active status to partner dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending registration status page for users awaiting admin approval, showing their name and requested role with a clock icon and informational alert.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Renders a styled badge component that displays user roles with role-specific colors and labels for superadmin, admin, finance, concierge, asistenmu, client, partner, and strategic partner roles.",
  "frontend/src/components/SuperadminClaimPage.tsx": "Provides a UI for the first user to claim superadmin privileges, displaying success/error states and redirecting to dashboard after successful claim.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, status, and timestamps with formatted dates and role-specific badges.",
  "frontend/src/components/UserManagementPage.tsx": "Admin/superadmin page that fetches and displays all users organized in collapsible sections (internal, asistenmu, client/partner) with refresh functionality and authorization checks.",
  "frontend/src/components/UserManagementTable.tsx": "Table component for displaying users with approve/reject actions, role editing, principal ID copying, and status badges with loading states for async operations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React hooks for managing user approvals including listing approvals, approving/rejecting users, and setting approval status with role assignment. Uses React Query for state management and invalidates relevant queries on mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login state, identity persistence, and delegation validation. Provides hooks and context for accessing authentication state throughout the React application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data, profiles, roles, tasks, and services (layanan). Includes queries for current user info, pending requests, and mutations for profile updates and user approval/rejection.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types: clients (with company info), partners (with city), and internal users (with role). Each mutation invalidates relevant user queries on success.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and claim superadmin role. Uses error handling to detect unauthorized access and determine if the system has no superadmin yet.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a premium boutique theme supporting light and dark modes. Includes color schemes for UI components, charts, and base styling for smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication. Renders the main App component with necessary context providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing. Includes sessionStorage persistence and functions to clear sensitive parameters from URLs after extraction.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter, Cal Sans), border radius variables, custom shadows, and keyframe animations for accordions and fade-in effects.",
  "project_state.json": "Project state metadata tracking three completed features: fixing infinite loading spinner bugs with try-catch-finally patterns, and converting two dropdowns (Client and Asistenmu) in ActivateServiceModal to searchable comboboxes that display names but submit user IDs."
}