{
  "backend/main.mo": "Main Motoko actor defining types (User, Role, Status, Layanan, Task, etc.) and business logic for user management, service/layanan management, task workflow, financial calculations, and partner assignments with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for user management UI, role display transformations, approval workflows, and dashboard integrations with high confidence mappings to test requirements.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, pages, and configuration files with descriptions of their functionality and styling.",
  "frontend/index.css": "Global CSS with Tailwind directives defining Premium Boutique OKLCH color system variables for light and dark modes using warm off-white backgrounds, midnight slate primary colors, and champagne gold accents.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Work Management Hub application.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, superadmin claim logic, user profile loading, and role-based routing to appropriate dashboards (Partner, Client, Internal, Admin) with TanStack Router integration.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with client/asistenmu selection via comboboxes, service type dropdown, unit quantity input, formatted price input with thousand separators, and effective hours/GMV calculations.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays pending, approved, and rejected user registrations with approve/reject actions. Uses approval management hooks and displays statistics cards, tables with user data, and handles user approval workflows with toast notifications.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Displays a banner showing the current user's approval status (approved or pending) with appropriate icons and styling. Uses the useIsCallerApproved hook to fetch approval state.",
  "frontend/src/components/ApprovedUserView.tsx": "Routes users to appropriate views based on their role and approval status: admins see AdminDashboard, unapproved users see PendingApprovalView, and approved non-admin users see a welcome placeholder. Includes header, approval banner, and footer.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard for managing tasks and services, including creating new tasks, viewing active services, approving estimates, and editing profile information. Features dialogs for task creation and profile editing, with WhatsApp integration and real-time updates via React Query.",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and collects client information (name, company, phone, email). Redirects active clients to dashboard and shows success state after registration.",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog for editing a user's role with a dropdown selector for all available roles (client, partner, admin, etc.). Handles role updates via actor and invalidates queries on success.",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal users (superadmin, admin, finance, etc.) displaying pending user approval requests with approve/reject actions, service activation modal access, and user management features based on role permissions.",
  "frontend/src/components/InternalSystemPage.tsx": "Registration and login page for internal system users, allowing authenticated users to register with internal roles (admin, finance, concierge, asistenmu, strategicPartner) and redirecting active internal users to the dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page featuring hero section, service cards with expandable details, navigation to partner portal and client registration, and WhatsApp contact integration.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button component that handles Internet Identity login/logout with loading states and supports both default and hero variants.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard page for partner users displaying profile information (ID, name, city, status) with header navigation and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration portal allowing authenticated users to register as partners by providing name and city, with automatic redirect to dashboard for active partners.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending registration status page for users awaiting admin approval, showing their name and requested role with a clock icon and alert message.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Renders a styled badge component for different user roles (superadmin, admin, finance, concierge, asistenmu, client, partner, strategic partner) with role-specific colors and labels.",
  "frontend/src/components/SuperadminClaimPage.tsx": "Provides a UI for the first user to claim superadmin privileges, displaying success/error states and redirecting to dashboard after successful claim.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, status, and registration timestamp in a card layout with formatted dates and role badges.",
  "frontend/src/components/UserManagementPage.tsx": "Admin dashboard for managing users with search functionality, displaying pending requests and all users, with statistics cards showing counts by role and status, and refresh capabilities.",
  "frontend/src/components/UserManagementTable.tsx": "Table component for displaying users with approve/reject actions for pending users, edit role functionality for active users, and copy-to-clipboard for principal IDs, with status badges and role displays.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for managing user approvals including listing, approving, and rejecting users with mutations that invalidate relevant queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with hooks for login, logout, and identity management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching user profiles, roles, approval status, pending requests, and mutations for updating profiles and managing user approvals.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types (client, partner, internal) that invalidate user-related queries on success.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and to claim superadmin privileges, invalidating all user-related queries after successful claim.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a premium boutique theme supporting both light and dark modes with OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Cal Sans), border radius variables, custom shadows (soft, glow, gold), and animation keyframes for accordions and fade-in effects.",
  "project_state.json": "Project state document tracking a Premium Boutique user management system with role-based access control, documenting the current fix for 'Invalid requested role' error in user approval flow and architectural notes about role handling between frontend (Title Case) and backend (lowercase strings)."
}