{
  "backend/main.mo": "Main backend actor defining types (User, Role, Status, Task, Layanan) and business logic for user management, service/task workflows, partner assignments, financial calculations, and approval processes with access control integration.",
  "feature_evidence.json": "Feature evidence report documenting two user management features: removing manual status filtering in UserManagementPage.tsx and triggering query refetch after approval in UserManagementTable.tsx.",
  "frontend-file-summaries.txt": "Aggregated summaries of frontend files including components for authentication, registration flows, dashboards, user management, and React Query hooks for backend integration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes with warm off-white backgrounds, midnight slate primary colors, and champagne gold accents.",
  "frontend/index.html": "HTML entry point for the Work Management Hub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component handling authentication flow, superadmin claim, user registration status checks, and role-based routing to appropriate dashboards (Partner, Client, Internal, or Admin) with loading states.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with client/asistenmu selection via comboboxes, service type dropdown, unit quantity and price inputs, effective hours calculation, and form validation with formatted currency display.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays pending, approved, and rejected user approvals with actions to approve or reject users. Includes statistics cards, user tables, and integrates with approval management hooks.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Banner component that displays the current user's approval status (approved, pending, or rejected) with appropriate icons and messaging.",
  "frontend/src/components/ApprovedUserView.tsx": "Main view component that routes users based on their role and approval status: admins see AdminDashboard, unapproved users see PendingApprovalView, and approved non-admin users see a placeholder dashboard.",
  "frontend/src/components/ClientDashboard.tsx": "Client-specific dashboard showing tasks, active services, and profile management with functionality to create tasks, approve estimates, and update profile information. Includes dialogs for task creation and profile editing.",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and collects client information (name, company, phone, email) for registration. Redirects active clients to their dashboard.",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog component for admins to update a user's role, displaying current role and providing a dropdown to select from available roles (client, partner, admin, etc.).",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal users (superadmin, admin, finance, etc.) displaying pending user approval requests with approve/reject actions, user profile dropdown, and conditional access to activate services and manage users based on role permissions.",
  "frontend/src/components/InternalSystemPage.tsx": "Internal system registration page allowing authenticated users to register with internal roles (admin, finance, concierge, asistenmu, strategic partner) and redirects active internal users to the internal dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page featuring hero section, navigation to partner/client portals, service selection, and WhatsApp contact link with expandable service cards and smooth scrolling.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component with Internet Identity integration, supporting default and hero variants with loading states and error handling.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard for partner users displaying profile information (ID, name, city, status) with header navigation and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration portal allowing authenticated users to register as partners with name and city information, redirecting active partners to their dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending registration status page for users awaiting admin approval, showing their name and requested role with a clock icon and informational alert.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Renders a styled badge component for displaying user roles with role-specific colors and labels (superadmin, admin, finance, concierge, asistenmu, client, partner, strategic partner).",
  "frontend/src/components/SuperadminClaimPage.tsx": "Provides a one-time interface for the first authenticated user to claim superadmin privileges, with success/error handling and automatic redirect after claiming.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, status, and registration timestamp in a card layout with formatted dates and role badges.",
  "frontend/src/components/UserManagementPage.tsx": "Admin dashboard for managing users with search functionality, statistics cards showing pending/active/total users, and a table displaying both pending and approved users with refresh capabilities.",
  "frontend/src/components/UserManagementTable.tsx": "Table component for displaying users with approve/reject actions for pending users, role editing for active users, status badges, and copy-to-clipboard for principal IDs.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with authentication, handling both anonymous and authenticated states, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for managing user approvals including listing approvals, approving/rejecting users, and setting approval status with role assignment.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and status tracking for ICP authentication flow.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching user profiles, roles, approval status, pending requests, and managing user operations like profile updates and user approval/rejection.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types: clients (with company info), partners (with city), and internal users (with role).",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists in the system and to claim superadmin privileges for the first user.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a premium boutique theme supporting light and dark modes with OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, typography settings with Inter and Cal Sans fonts, custom animations (accordion, fade-in), and extended utilities including shadows and border radius variables.",
  "project_state.json": "Project state tracking file documenting known issues with user approval workflow (data sync, approve button, auto-refresh), existing features for user management display and query invalidation, and a pending feature request to fix the approveUser backend function to properly handle role assignment from requestedRole."
}