{
  "backend/main.mo": "Main Motoko actor defining types (User, Role, Status, Layanan, Task, Withdrawal, etc.) and implementing business logic for user management, service activation, task workflows, financial calculations, partner assignments, and withdrawal requests with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting implemented requirements for ActivateServiceModal component, including modal structure, form fields (client/asistenmu/service type selectors, unit quantity, price inputs), reactive helper text for effective hours and GMV calculations, validation, and backend integration.",
  "frontend-file-summaries.txt": "JSON summaries of frontend files describing global styles, Tailwind config, routing setup, landing/registration/dashboard pages, hooks for queries/mutations, and component functionality across the application.",
  "frontend/index.css": "Global CSS with Tailwind directives and CSS custom properties defining OKLCH color system for light and dark modes with emerald/teal theme variables for UI components.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Work Management Hub application.",
  "frontend/src/App.tsx": "Root application component managing authentication flow with Internet Identity, checking superadmin existence, routing users to appropriate dashboards (Partner/Client/Internal) based on role and status, with loading states and TanStack Router integration.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating new services with form fields for client/asistenmu/service type selection, unit quantity and price inputs, reactive calculations for effective hours and GMV with thousand-separator formatting, validation, and submit handling.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays pending, approved, and rejected user registrations with approve/reject actions. Uses approval management hooks and displays statistics cards, tables, and status badges for user management.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Banner component that displays the current user's approval status (approved or pending) with appropriate icons and styling. Shows nothing while loading or if status is unavailable.",
  "frontend/src/components/ApprovedUserView.tsx": "Main view component that routes users based on role and approval status: admins see AdminDashboard, unapproved users see PendingApprovalView, and approved non-admin users see a welcome placeholder. Includes header, approval banner, and footer.",
  "frontend/src/components/ClientDashboard.tsx": "Client dashboard for viewing and managing tasks, creating new tasks linked to active services (layanan), and approving task estimates. Displays task status badges with masked internal statuses and provides logout functionality.",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and client registration with name and company fields. Redirects active clients to dashboard and shows registration form for new users.",
  "frontend/src/components/InternalDashboard.tsx": "Internal staff dashboard for superadmins and admins to view pending user registrations, approve/reject users, and activate services (for finance/superadmin roles). Displays user role labels and includes logout functionality.",
  "frontend/src/components/InternalSystemPage.tsx": "Internal system portal page that handles Internet Identity login and role-based registration for internal staff (admin, finance, concierge, etc.), redirecting active internal users to the internal dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page component featuring hero section, service cards, navigation to partner/client portals, and WhatsApp contact integration with smooth scrolling and expandable service descriptions.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button component that handles Internet Identity login/logout with loading states and supports default or hero variants.",
  "frontend/src/components/PartnerDashboard.tsx": "Partner dashboard page displaying partner profile information (ID, name, city, status) with header navigation and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration portal that handles Internet Identity authentication and partner sign-up with name and city fields, redirecting active partners to their dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "Status page displayed to users whose registration is pending admin approval, showing their submitted registration details (name and requested role).",
  "frontend/src/components/RegistrationFlow.tsx": "Empty file with no content.",
  "frontend/src/components/SuperadminClaimPage.tsx": "React component that allows the first authenticated user to claim superadmin privileges with a UI showing benefits, success/error states, and automatic redirect after claiming.",
  "frontend/src/components/UserInfoPage.tsx": "React component that displays the current user's profile information including name, role, status, and timestamps with formatted display helpers for roles and dates.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, initializes access control with a secret token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Custom React hooks for managing user approval workflows including listing approvals, approving/rejecting users, and assigning roles with query cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with idle handling options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user data, task management, and approval workflows with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useRegistration.ts": "Custom React hooks for self-registration mutations for three user types (client, partner, internal) with automatic query invalidation after successful registration.",
  "frontend/src/hooks/useSuperadminClaim.ts": "React hooks for checking if a superadmin exists (useHasSuperadmin) and claiming superadmin role (useClaimSuperadmin), using TanStack Query to manage actor calls and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for emerald/teal professional theme supporting light and dark modes, using OKLCH color space for design tokens.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH variables, typography plugin, container queries, custom animations (accordion, fade-in), and Inter/Cal Sans font families.",
  "project_state.json": "Project metadata for 'Asistenku' SaaS ticketing system describing Motoko backend on ICP, React frontend, service activation features, role-based access, known issues with stable variables, and mock data usage."
}