{
  "backend/main.mo": "Main Motoko actor defining types (User, Role, Status, Task, Layanan) and backend functions for user management, task workflow, service management, and financial operations with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: updating UserManagementPage to fetch from backendActor.getAllUsers() and fixing status/role filtering logic to handle Motoko variants as JavaScript objects using 'in' operator checks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (landing pages, dashboards, registration flows), hooks (queries, mutations, authentication), and styling configurations with Premium Boutique OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining Premium Boutique OKLCH color palette for light and dark modes, including background, foreground, primary, secondary, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Work Management Hub application.",
  "frontend/src/App.tsx": "Main application component handling authentication flow, superadmin claim logic, user profile loading, and role-based routing to appropriate dashboards (Partner, Client, Internal) with TanStack Router integration.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with client/asistenmu selection via comboboxes, service type dropdown, unit quantity input, price formatting with thousand separators, and effective hours/GMV calculations.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays pending, approved, and rejected user approvals with actions to approve or reject users. Includes stats cards, tables for managing user registrations, and uses toast notifications for feedback.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Displays a banner showing the current user's approval status (approved or pending) with appropriate icons and styling. Returns null while loading.",
  "frontend/src/components/ApprovedUserView.tsx": "Routes users based on their role and approval status: admins see AdminDashboard, unapproved users see PendingApprovalView, and approved non-admin users see a welcome placeholder with profile link.",
  "frontend/src/components/ClientDashboard.tsx": "Client dashboard for managing tasks and services, including creating new tasks, approving estimates, viewing active services, and editing user profile. Features task list with status badges and WhatsApp integration.",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and collects client information (name, company, phone, email). Redirects active clients to dashboard automatically.",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog for admins to update a user's role, displaying current role and principal ID with a dropdown selector for all available roles (client, partner, admin, etc.).",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal users (superadmin, admin, finance, etc.) displaying pending user requests with approve/reject actions, user profile dropdown, and conditional access to activate services and manage users based on role.",
  "frontend/src/components/InternalSystemPage.tsx": "Registration and login page for internal team members (admin, finance, concierge, asistenmu, strategic partner) with Internet Identity authentication and role selection form.",
  "frontend/src/components/LandingPage.tsx": "Main landing page featuring hero section, service cards with expandable details, navigation to partner portal and client registration, and WhatsApp contact integration.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component with Internet Identity integration, supporting default and hero variants with loading states.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard for partner users displaying profile information (ID, name, city, status) with header navigation and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration and login page with Internet Identity authentication, form for name and city input, and automatic redirect to dashboard for active partners.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending registration status page for users awaiting admin approval, showing their name and requested role with a clock icon and alert message.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Renders a styled badge component for displaying user roles with color-coded variants for each role type (superadmin, admin, finance, concierge, asistenmu, client, partner, strategicPartner).",
  "frontend/src/components/SuperadminClaimPage.tsx": "Provides a UI for the first user to claim superadmin privileges, displaying benefits and handling the claim mutation with success/error states and automatic redirect.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, status, and registration timestamp with formatted dates and role-specific badges.",
  "frontend/src/components/UserManagementPage.tsx": "Admin dashboard for managing all users with search functionality, categorizing users into pending, active, rejected, and all tabs, displaying statistics cards and using UserManagementTable for the user list.",
  "frontend/src/components/UserManagementTable.tsx": "Table component displaying user data with actions to approve/reject pending users, copy principal IDs, edit roles, and showing status badges with loading states for async operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React hooks for managing user approvals including listing, approving, and rejecting users with mutations that invalidate relevant queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and status tracking for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating user profiles, roles, tasks, and services (layanan) from the backend actor.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types: clients, partners, and internal users with different required fields.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and claim superadmin role for the first user in the system.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a premium boutique theme supporting light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter, Cal Sans), border radius variables, custom shadows (soft, glow, gold), and keyframe animations (accordion, fade-in).",
  "project_state.json": "Project state tracking file documenting an internal ticketing system with role-based access control (Superadmin/Admin/User), architectural notes about Motoko variant handling in JavaScript, and completed features related to fixing user management page filtering and statistics calculations."
}