{
  "backend/main.mo": "Main actor defining user roles, layanan (services), tasks, and financial workflows with access control, user approval, and migration support. Includes functions for ID generation, user/layanan/task management, and task lifecycle operations (create, estimate, approve, assign, complete).",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema by adding jamEfektif and levelPartner fields to InternalData and jamOnHold field to Layanan records with default values.",
  "feature_evidence.json": "Empty feature evidence report with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of frontend components, hooks, and configuration files describing the application's UI structure, routing, authentication, and data management patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes including background, foreground, primary, secondary, accent, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Work Management Hub application.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, superadmin claim, user registration status checks, and role-based routing to appropriate dashboards (Partner, Client, Internal) with loading states.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying pending user registrations with approve/reject actions, stats cards showing pending/approved/rejected counts, and tables for legacy approvals and all users with toast notifications.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Banner component showing user approval status with CheckCircle icon for approved users or Clock icon for pending approval with appropriate alert styling.",
  "frontend/src/components/ApprovedUserView.tsx": "Renders different views based on user role and approval status: admin dashboard for admins, pending approval view for unapproved users, or a placeholder welcome page for approved non-admin users.",
  "frontend/src/components/ClientDashboard.tsx": "Client dashboard component that displays tasks, allows creating new tasks with service details, and enables clients to approve task estimates with status badges and action buttons.",
  "frontend/src/components/ClientRegisterPage.tsx": "Registration page for clients that handles Internet Identity login and collects name and company information, redirecting active clients to their dashboard.",
  "frontend/src/components/InternalDashboard.tsx": "Dashboard for internal staff (admin/superadmin) that displays pending user requests with approve/reject actions and shows user role information.",
  "frontend/src/components/InternalSystemPage.tsx": "Registration page for internal staff roles (admin, finance, concierge, etc.) with Internet Identity login and role selection, redirecting active internal users to their dashboard.",
  "frontend/src/components/LandingPage.tsx": "Public landing page with hero section, navigation to partner/client portals, service selection, and WhatsApp contact link for the Asistenku work management platform.",
  "frontend/src/components/LoginButton.tsx": "A reusable login/logout button component that integrates with Internet Identity, supports two visual variants ('default' and 'hero'), and handles authentication state with loading indicators.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard view for partners showing user profile information (ID, name, city, status) with a header containing avatar dropdown menu and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration and portal access page that handles Internet Identity login, displays registration form for new partners (name and city), and redirects active partners to their dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending status screen for users whose registration is awaiting admin approval, showing their submitted name and requested role.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty component file with no content.",
  "frontend/src/components/SuperadminClaimPage.tsx": "First-time setup page allowing the initial authenticated user to claim superadmin privileges with a one-time claim action and success/error handling.",
  "frontend/src/components/UserInfoPage.tsx": "Displays authenticated user's profile information including name, role, and status with formatted role names and timestamps.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for managing user approvals including listing approvals, approving/rejecting users, and setting approval status with role assignment.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and session state tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching user profiles, roles, approval status, and managing tasks including creation, estimation, approval, partner assignment, and status updates.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types: clients (with company), partners (with city), and internal users (with role).",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and claim superadmin role, with query invalidation to refresh user state after claiming.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom emerald/teal color theme variables for light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter/Cal Sans fonts, custom shadows, border radius variables, and animation keyframes for accordions and fade-in effects.",
  "project_state.json": "Project state tracking document for a Motoko-based service management system with three pending feature requests: updateTaskStatus for revision cycles, completeTask for financial triggers with partner payments, and getClientTasks for client-facing views with status masking."
}