{
  "backend/main.mo": "Main backend actor defining 8 user roles (superadmin, admin, finance, concierge, strategicPartner, asistenmu, client, partner), user management with approval workflow, service/layanan management with time-based units, task workflow with multiple statuses, financial calculations, and partner assignment logic.",
  "backend/migration.mo": "Migration module with a no-op run function that returns state unchanged.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, hooks, and configuration files with their functionality descriptions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application router component handling authentication flow with Internet Identity, superadmin claim logic, user registration status checks, and role-based routing to appropriate dashboards (Partner, Client, Internal, or Admin).",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with client and asistenmu selection via comboboxes, service type dropdown (Tenang, Rapi, Fokus, Jaga, Efisien), unit quantity and price inputs with currency formatting, and effective hours/GMV calculations.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying pending user registrations with approve/reject actions, statistics cards showing pending/approved/rejected counts, and tables for legacy approvals and all users with status badges and toast notifications.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Displays a banner showing the user's approval status (approved or pending) using alerts with icons and styled messages.",
  "frontend/src/components/ApprovedUserView.tsx": "Main routing component that displays AdminDashboard for admins, PendingApprovalView for unapproved users, or a placeholder dashboard for approved non-admin users.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard for managing tasks and services, including task creation, profile editing, and viewing active services with WhatsApp integration.",
  "frontend/src/components/ClientRegisterPage.tsx": "Registration page for new clients to authenticate via Internet Identity and submit registration details (name, company, phone, email).",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog for admins to update a user's role with a dropdown selector and save functionality that invalidates user queries.",
  "frontend/src/components/InternalDashboard.tsx": "Internal staff dashboard showing pending user approvals with approve/reject actions, and access to service activation for finance/admin roles.",
  "frontend/src/components/InternalSystemPage.tsx": "Internal system portal page for Asistenku staff (admin, finance, concierge, etc.) with Internet Identity login and role-based registration form. Redirects authenticated internal users with active status to the internal dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page component featuring hero section, service cards with expandable details, and navigation to partner portal, client login/registration. Includes WhatsApp contact link and smooth scrolling to services section.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component that integrates with Internet Identity, supports two variants (default and hero), and handles authentication state with loading indicators.",
  "frontend/src/components/PartnerDashboard.tsx": "Dashboard view for authenticated partners displaying profile information (ID, name, city, status) with header navigation and logout functionality. Shows loading state while fetching user data.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration portal with Internet Identity login and registration form collecting name and city. Redirects active partners to their dashboard automatically.",
  "frontend/src/components/PendingApprovalView.tsx": "Status page shown to users whose registration is pending admin approval, displaying their submitted name and requested role with a clock icon indicator.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty component file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Displays a styled badge for user roles (superadmin, admin, finance, concierge, asistenmu, client, partner, strategic partner) with role-specific colors and labels.",
  "frontend/src/components/SuperadminClaimPage.tsx": "A React component that allows the first authenticated user to claim superadmin privileges, displaying a card with claim button, success/error alerts, and redirecting to dashboard upon successful claim.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, and status with formatted badges and timestamps, showing a loading state while fetching data.",
  "frontend/src/components/UserManagementPage.tsx": "Admin page for managing users with search functionality, displaying pending requests and all users in a table, combining data from getPendingRequests and listApprovals queries.",
  "frontend/src/components/UserManagementTable.tsx": "Table component that renders user data with actions to approve/reject pending users, copy principal IDs, and edit roles, invalidating multiple query keys on mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for user approval management including listing approvals, approving/rejecting users, with mutations that invalidate relevant query caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data, tasks, and services, including profile management, user approval, task operations, and partner assignments.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of three user types (Client, Partner, Internal) with automatic query invalidation on success.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and claim superadmin privileges, with query invalidation on successful claim.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light/dark themes using a premium boutique design system.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH colors, typography, container queries, animations, and design system tokens.",
  "project_state.json": "Project state tracking an internal ticketing system with role-based access control requiring three pending feature updates: adding #superadmin variant to UserRole enum, updating isAdmin function to recognize both #admin and #superadmin roles, and implementing state synchronization to correctly assign Superadmin Principal the #superadmin role."
}