{
  "backend/main.mo": "Main backend actor defining types (User, Role, Status, Layanan, Task, etc.) and implementing user management, service/task workflows, financial calculations, partner assignments, and approval systems with access control and authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, hooks, styling, and routing configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining CSS variables for light and dark modes including background, foreground, primary, secondary, accent, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component handling authentication flow, superadmin claim, user profile loading, and role-based routing to appropriate dashboards (Partner, Client, Internal, or Admin) with TanStack Router integration.",
  "frontend/src/components/ActivateServiceModal.tsx": "Modal component for activating services with dropdowns for selecting clients and asistenmu users, service type selection, unit quantity and price inputs with currency formatting, and effective hours/GMV calculations.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying pending user registrations with approve/reject actions, stats cards showing pending/approved/rejected counts, and tables for legacy approvals and all users with status badges.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Displays a banner showing the user's approval status (approved or pending) using the useIsCallerApproved hook with appropriate icons and styling.",
  "frontend/src/components/ApprovedUserView.tsx": "Main routing component that displays AdminDashboard for admin users, PendingApprovalView for unapproved users, or a placeholder dashboard for approved non-admin users.",
  "frontend/src/components/ClientDashboard.tsx": "Full-featured client dashboard for managing tasks, viewing active services, creating new tasks, approving estimates, and editing profile with WhatsApp integration. (Content truncated in source)",
  "frontend/src/components/ClientRegisterPage.tsx": "Client registration page that handles Internet Identity login and collects client information (name, company, phone, email) for registration. (Content truncated in source)",
  "frontend/src/components/EditRoleModal.tsx": "Modal dialog component for admins to update user roles with a dropdown selector and save functionality that invalidates the user query cache.",
  "frontend/src/components/InternalDashboard.tsx": "Internal staff dashboard showing pending user approvals with approve/reject actions, and conditional access to service activation and user management based on role. (Content truncated in source)",
  "frontend/src/components/InternalSystemPage.tsx": "Internal system portal page that handles Internet Identity login, role-based registration for internal staff (admin, finance, concierge, etc.), and redirects authenticated internal users to the dashboard.",
  "frontend/src/components/LandingPage.tsx": "Main landing page component featuring hero section, service cards with expandable details, navigation to partner/client portals, and WhatsApp contact integration.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button component that handles Internet Identity login/logout with loading states and supports default and hero variants.",
  "frontend/src/components/PartnerDashboard.tsx": "Partner dashboard page displaying partner profile information (ID, name, city, status) with header navigation and logout functionality.",
  "frontend/src/components/PartnerPortalPage.tsx": "Partner registration portal that handles Internet Identity login, collects partner name and city information, and redirects active partners to their dashboard.",
  "frontend/src/components/PendingApprovalView.tsx": "Displays a pending approval status page for users whose registration is under admin review, showing their submitted name and requested role.",
  "frontend/src/components/RegistrationFlow.tsx": "Empty component file with no content.",
  "frontend/src/components/RoleBadge.tsx": "Renders styled badge components for different user roles (superadmin, admin, finance, client, partner, etc.) with role-specific colors and labels.",
  "frontend/src/components/SuperadminClaimPage.tsx": "A page component that allows the first authenticated user to claim superadmin privileges, displaying a card with claim button, success/error alerts, and redirecting to dashboard upon successful claim.",
  "frontend/src/components/UserInfoPage.tsx": "Displays the current user's profile information including name, role, status, and registration timestamp with formatted badges and icons, showing loading state while fetching data.",
  "frontend/src/components/UserManagementPage.tsx": "Admin page for managing users with search functionality, displaying pending and active users in a table, fetching data from both getPendingRequests and listApprovals endpoints with refresh capabilities.",
  "frontend/src/components/UserManagementTable.tsx": "Table component that renders user rows with approve/reject actions for pending users, copy-to-clipboard for principal IDs, role editing modal, and status badges, invalidating multiple query keys on mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for user approval operations including listing approvals, approving users, and rejecting users, with automatic query invalidation after mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, tasks, and admin operations like approving/rejecting users, using the backend actor.",
  "frontend/src/hooks/useRegistration.ts": "Provides mutation hooks for self-registration of clients, partners, and internal users, invalidating relevant queries on success.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Exports hooks to check if a superadmin exists and to claim superadmin privileges, invalidating user-related queries after claiming.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a premium boutique theme supporting light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom colors using OKLCH, typography, container queries, animations, and design tokens for a premium UI.",
  "project_state.json": "Project state for a Work Management Hub backend with role-based access control (Admin, Superadmin, User) in Motoko. Currently fixing authorization bug where helper functions for assigning user roles incorrectly restrict Superadmin access, only allowing Admin despite approval functions already permitting Superadmin."
}