{
  "backend/main.mo": "Main actor implementing user management with 8 roles (superadmin, admin, finance, concierge, strategicPartner, asistenmu, client, partner), user approval workflow, access control integration, and admin functions for managing pending/active user statuses.",
  "backend/migration.mo": "Migration module defining user types (Role, Status, User) and a no-op migration function that preserves the existing users Map during upgrades.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 17 frontend files covering styling, routing, authentication, registration, approval workflows, admin dashboard, and user profile components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements like backgrounds, borders, and charts.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, superadmin claim routing, user registration, and approval status checks with TanStack Router and loading states.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying pending user registrations with approve/reject actions, stats cards, legacy approvals table, and toast notifications for user management operations.",
  "frontend/src/components/ApprovalStatusBanner.tsx": "Banner component showing user approval status (approved or pending) with appropriate icons and styling.",
  "frontend/src/components/ApprovedUserView.tsx": "Router component that renders AdminDashboard for admins, PendingApprovalView for unapproved users, or a placeholder dashboard with profile link for approved non-admin users.",
  "frontend/src/components/LandingPage.tsx": "Landing page component displaying hero section, feature cards (multi-role system, secure access, approval workflow), header with logo and login button, and footer with attribution link.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component with two variants (default and hero) that handles Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/PendingApprovalView.tsx": "View shown to users whose registration is pending admin approval, displaying their name and requested role with a waiting status message.",
  "frontend/src/components/RegistrationFlow.tsx": "Multi-step registration form allowing new users to enter their name and select a role from 7 available options, showing success state after submission.",
  "frontend/src/components/SuperadminClaimPage.tsx": "Special page allowing the first authenticated user to claim superadmin privileges with a one-time action button and success redirect.",
  "frontend/src/components/UserInfoPage.tsx": "User profile page displaying authenticated user's name, role, status, and registration timestamp with formatted role names and dates.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useApprovalManagement.ts": "Provides React Query hooks for managing user approvals including listing approvals, approving/rejecting users, and setting approval status with role assignment.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and session state tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching user data including caller profile, role, approval status, current user info, and pending registration requests.",
  "frontend/src/hooks/useRegistration.ts": "Provides a mutation hook for user self-registration that maps frontend role selections (client, partner, internal roles) to backend registration functions.",
  "frontend/src/hooks/useSuperadminClaim.ts": "Implements hooks to check if a superadmin exists and claim superadmin privileges, with query invalidation on successful claim.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light/dark themes using an emerald/teal professional color scheme.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH, container settings, extended theme properties, animations, and plugin integrations.",
  "project_state.json": "Project state tracking user management system with self-registration for clients, partners, and internal staff roles. Contains 8 feature requests (AR-1 to AR-8) to unlock getCallerUserProfile and add self-registration functions with pending status approval workflow."
}