{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix user approval flow and update user management UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fetch and display requestedRole field in UserManagementPage and UserManagementTable, transforming lowercase backend values to Title Case for UI display",
      "acceptanceCriteria": [
        "The Role column in the User Pending table displays 'Client', 'Asistenmu', or 'Admin' instead of 'unknown'",
        "Lowercase role strings from backend are transformed to Title Case in the UI",
        "No 'unknown' values appear in the Role column"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UserManagementTable.tsx",
          "operation": "modify",
          "description": "Add a helper function to transform requestedRole from lowercase ('client', 'asistenmu', 'admin') to Title Case ('Client', 'Asistenmu', 'Admin'). Update the Role column rendering logic to use user.requestedRole from the backend User type and apply the transformation. Ensure the Role column displays the transformed value instead of 'unknown'."
        },
        {
          "path": "frontend/src/components/UserManagementPage.tsx",
          "operation": "modify",
          "description": "Verify that getPendingRequests query properly fetches User objects with requestedRole field. Ensure the data passed to UserManagementTable includes the requestedRole field from backend."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Approve button to send principalId and lowercase requestedRole to backend, add loading spinner during approval transaction",
      "acceptanceCriteria": [
        "Approve button sends principalId and lowercase requestedRole to backend",
        "A loading spinner appears on the Approve button during approval",
        "The 'Invalid requested role' error no longer occurs when approving users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UserManagementTable.tsx",
          "operation": "modify",
          "description": "Update the Approve button click handler to call approveUser with user.principalId parameter. Add local loading state (using useState) for each row's Approve button. Display a loading spinner (using Loader2 from lucide-react with animate-spin) inside the Approve button during the approval mutation. Ensure the button is disabled while loading."
        },
        {
          "path": "frontend/src/hooks/useApprovalManagement.ts",
          "operation": "modify",
          "description": "Verify that the approveUser mutation correctly calls backend.approveUser(principalId) with the Principal parameter. Ensure error handling is in place for the approval mutation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update UserManagementTable to display user detail columns including Name, Business, City, WhatsApp, Requested Role (Title Case), and Principal ID (monospace)",
      "acceptanceCriteria": [
        "User management table displays all specified columns: Name, Business, City, WhatsApp, Requested Role, Principal ID",
        "Principal ID is displayed in monospace font with small size",
        "Requested Role shows Title Case labels"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UserManagementTable.tsx",
          "operation": "modify",
          "description": "Update the table columns to display: Name (user.name), Business (user.companyBisnis or '-' if empty), City (user.kotaDomisili or '-' if empty), WhatsApp (user.phoneNumber or '-' if empty), Requested Role (user.requestedRole transformed to Title Case), and Principal ID (user.principalId.toText() with 'font-mono text-xs' classes and truncation for long IDs). Ensure all columns render data from the User type in backend interface."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Integrate getCurrentUser backend function in ClientDashboard to display personalized user name in welcome greeting with fallback",
      "acceptanceCriteria": [
        "Dashboard displays personalized greeting using user.name from getCurrentUser()",
        "If name is empty or unavailable, displays 'Client' as fallback",
        "No errors occur when fetching user data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useGetCurrentUser hook that calls backend.getCurrentUser() and returns the User object. Use React Query with queryKey ['currentUser'] and appropriate error handling. Enable the query only when actor is available."
        },
        {
          "path": "frontend/src/components/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Import and use the useGetCurrentUser hook to fetch current user data. Update the welcome greeting to display user.name if available, otherwise display 'Client' as fallback. Handle loading and error states appropriately."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement task metrics in ClientDashboard by fetching from getClientTasks and counting by status on frontend",
      "acceptanceCriteria": [
        "Dashboard displays three task metric cards with counts based on status filtering",
        "'Task Meminta Review Kamu' shows count of tasks with status 'Client Review'",
        "'Task Sedang Dikerjakan' shows count of tasks with status 'Sedang Dikerjakan'",
        "'Task Selesai' shows count of tasks with status 'Completed'",
        "Metrics display 0 when no tasks are available for each status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Add frontend logic to count tasks by status after fetching from getClientTasks. Create three metric card components displaying: 'Task Meminta Review Kamu' (count tasks where task.status === 'Client Review'), 'Task Sedang Dikerjakan' (count tasks where task.status === 'Sedang Dikerjakan'), and 'Task Selesai' (count tasks where task.status === 'Completed'). Use useMemo to compute counts efficiently. Display 0 as fallback when no tasks exist for each status. Position metric cards above the existing task table."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Maintain Boutique theme consistency across updated components with bg-[#FDFCFB], thin gold shadows, and Midnight Slate text",
      "acceptanceCriteria": [
        "All updated components use bg-[#FDFCFB] for backgrounds",
        "Components maintain thin gold shadow styling",
        "Text uses Midnight Slate color from the design system",
        "Visual consistency matches existing Boutique theme across all pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UserManagementPage.tsx",
          "operation": "modify",
          "description": "Verify and ensure the page uses bg-[#FDFCFB] for main background. Apply thin gold shadow (shadow-sm with gold/champagne accent) to cards and containers. Use Midnight Slate text colors (text-slate-800 or equivalent) consistently throughout the component."
        },
        {
          "path": "frontend/src/components/UserManagementTable.tsx",
          "operation": "modify",
          "description": "Verify and ensure table cards/containers use bg-[#FDFCFB] backgrounds. Apply thin gold shadows to table rows or container elements. Use Midnight Slate text colors for all text content. Ensure buttons maintain the boutique theme colors."
        },
        {
          "path": "frontend/src/components/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Verify and ensure dashboard uses bg-[#FDFCFB] for main background. Apply thin gold shadows to metric cards, task cards, and container elements. Use Midnight Slate text colors consistently. Ensure new metric cards match the existing design system."
        }
      ]
    }
  ]
}